Integrations/SOAP BOILER PLATE.xml

<!-- SOAP BOILER PLATE -->

<soap:Envelope
        xmlns:soap="http://schemas.xmlsoap.org/..."
        xmlns:soapenc="http://schemas.xmlsoap.org/...">
    <soap:Header>
        <soap:mustUnderstand="1">
        <h:MessageID xmlns:h="http://myheader.org/">
        4711-88/15
        </h:MessageID>
    </soap:header>
    <soap:Body>
        <GetOrderList xmlns="http://tempuri.org/">
            <OrderNumber> order-nr-x </OrderNumber>
        </GetOrderList>
    </soap:Body>
</soap:Envelope>


<!-- Body boiler plate for postman, not sure about w3 urls -->
<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema=instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Body>
    <n1:login xmlns:n1="urn:enterprise.soap.sforce.com">
        <n1:username>davisrichardsanchez@resilient-goat-jg51u7.com</n1:username>
        <n1:password>Loaves4769!</n1:password>
    </n1:login>
  </env:Body>
</env:Envelope>